src/test/resources/btcpayserverInvoiceResponse.json

{
  "facade": "pos/invoice",
  "data": {
    "url": "https://payments.mathbot.com/invoice?id=3kiDv4CZzb2h5zFe38Da6o",
    "posData": null,
    "status": "new",
    "btcPrice": "0.00001100",
    "btcDue": "0.00001100",
    "cryptoInfo": [
      {
        "cryptoCode": "BTC",
        "paymentType": "BTCLike",
        "rate": 9095.3,
        "exRates": {
          "USD": 0
        },
        "paid": "0.00000000",
        "price": "0.00001100",
        "due": "0.00001100",
        "paymentUrls": {
          "BIP21": "bitcoin:bc1q8hck72ed99jgvcwckcp00ty4veh43cmtd4tm29?amount=0.000011",
          "BIP72": null,
          "BIP72b": null,
          "BIP73": null,
          "BOLT11": null
        },
        "address": "bc1q8hck72ed99jgvcwckcp00ty4veh43cmtd4tm29",
        "url": "https://payments.mathbot.com/i/BTC/3kiDv4CZzb2h5zFe38Da6o",
        "totalDue": "0.00001100",
        "networkFee": "0.00000000",
        "txCount": 0,
        "cryptoPaid": "0.00000000",
        "payments": []
      }
    ],
    "price": 0.1,
    "currency": "USD",
    "exRates": {
      "USD": 0
    },
    "buyerTotalBtcAmount": null,
    "itemDesc": "Sponsor player",
    "itemCode": null,
    "orderId": "mathbot.com - sponsorship",
    "guid": "10b6d41a-4e8e-4a94-9b92-380e8164a92f",
    "id": "3kiDv4CZzb2h5zFe38Da6o",
    "invoiceTime": 1593788774000,
    "expirationTime": 1593789674000,
    "currentTime": 1593788774776,
    "lowFeeDetected": false,
    "btcPaid": "0.00000000",
    "rate": 9095.3,
    "exceptionStatus": false,
    "paymentUrls": {
      "BIP21": "bitcoin:bc1q8hck72ed99jgvcwckcp00ty4veh43cmtd4tm29?amount=0.000011",
      "BIP72": null,
      "BIP72b": null,
      "BIP73": null,
      "BOLT11": null
    },
    "refundAddressRequestPending": false,
    "buyerPaidBtcMinerFee": null,
    "bitcoinAddress": "bc1q8hck72ed99jgvcwckcp00ty4veh43cmtd4tm29",
    "token": "SwK8DZUd1jM2iwNCk9RRHM",
    "flags": {
      "refundable": false
    },
    "paymentSubtotals": {
      "BTC": 1100
    },
    "paymentTotals": {
      "BTC": 1100
    },
    "amountPaid": 0,
    "minerFees": {
      "BTC": {
        "satoshisPerByte": 48,
        "totalFee": 0
      }
    },
    "exchangeRates": {
      "BTC": {
        "USD": 0
      }
    },
    "supportedTransactionCurrencies": {
      "BTC": {
        "enabled": true,
        "reason": null
      }
    },
    "addresses": {
      "BTC": "bc1q8hck72ed99jgvcwckcp00ty4veh43cmtd4tm29"
    },
    "paymentCodes": {
      "BTC": {
        "BIP21": "bitcoin:bc1q8hck72ed99jgvcwckcp00ty4veh43cmtd4tm29?amount=0.000011",
        "BIP72": null,
        "BIP72b": null,
        "BIP73": null,
        "BOLT11": null
      }
    },
    "buyer": {
      "name": "t",
      "address1": null,
      "address2": null,
      "locality": null,
      "region": null,
      "postalCode": null,
      "country": null,
      "phone": null,
      "email": "yoloswaggins@gmail.com"
    }
  }
}
